package com.ict01.grammar03;
class Ex11{
	public static void main(String[] args){
	//  다중 if문 :  조건식이 거짓일때  다시 조건식을 사용한다.
	//  if(조건식1){
        //     조건식1이 참일때 실행;
        //   } else if(조건식2){
        //     조건식1은 거짓이면서 조건식2는 참일때 실행 ;
        //   } else if(조건식3){
        //     조건식1,2은 거짓이면서 조건식3는 참일때 실행 ;
	//   } else {
	//     조건식 1,2,3  모두 거짓일때, 나머지인 경우 
        //   }

	// int k1의 점수가 90이상이면 A, 80이상이면 B, 70이상이면 C, 나머지 F
	// char k2가 대문자인지, 소문자인지, 숫자인지, 기타문자인지 판별
	// char k3가 A,a이면 아프리카 B,b이면 브라질 C,c이면 캐나다 나머지 한국
        
        // menu가 1이면 카페모카 3500, 2이면 카페라떼 4000, 
        // 3이면 아메리카노 3000, 4이면 과일쥬스 3500이다. 
        // 친구와 2잔을 10000내고 먹었다. 
	// 잔돈은 얼마인가? (단, 부가세 10%를 포함 시키자) 

	}
}













